#include <stdio.h>

int check_sys()
{
	int a = 1;
	char* p = (char*)&a;

	return *p;
}

int main(void)
{
	//int i = 3;
	//i = -i++;
	//printf("%d\n", i);
	//return 0;


	//原码
	//10000000000000000000000000001010-原码

	//反码（符号位不变，其他位取反加1）
	//11111111111111111111111111110101-反码
	
	//反码加1得到补码
	//11111111111111111111111111110110-补码
	 
	 
	// 1-1也可以写为1+(-1)
	// 00000000000000000000000000000001 --  1的原码
	// 10000000000000000000000000000001 -- -1的原码
	// 如果它们相加，计算结果错误，得到-2
	// 10000000000000000000000000000010 -- -2的原码
	// 由此可知，不能将内存以原码形式存储在内存中，否则不能进行计算。

	//int b = 10;

	//判断当前机器的字节序

	int ret = check_sys();
	if (ret) {
		printf("小端字节序\n");
	}
	else {
		printf("大端字节序\n");
	}


	return 0;
}